Magicoe/LPC55S3x_Test_code/example_code/lpc55s3x_mdk/drivers/fsl_i3c.h
/*! @brief I3C slave transfer structure */
typedef struct _i3c_slave_transfer
{
    uint32_t event;            /*!< Reason the callback is being invoked. */
    uint8_t *txData;           /*!< Transfer buffer */
    size_t txDataSize;         /*!< Transfer size */
    uint8_t *rxData;           /*!< Transfer buffer */
    size_t rxDataSize;         /*!< Transfer size */
    status_t completionStatus; /*!< Success or error code describing how the transfer completed. Only applies for
                                  #kI3C_SlaveCompletionEvent. */
    size_t transferredCount;   /*!< Number of bytes actually transferred since start or last repeated start. */
} i3c_slave_transfer_t;

/* Forward declaration. */
typedef struct _i3c_slave_handle i3c_slave_handle_t;

/*!
 * @brief Slave event callback function pointer type.
 *
 * This callback is used only for the slave non-blocking transfer API. To install a callback,
 * use the I3C_SlaveSetCallback() function after you have created a handle.
 *
 * @param base Base address for the I3C instance on which the event occurred.
 * @param transfer Pointer to transfer descriptor containing values passed to and/or from the callback.
 * @param userData Arbitrary pointer-sized value passed from the application.
 */
typedef void (*i3c_slave_transfer_callback_t)(I3C_Type *base, i3c_slave_transfer_t *transfer, void *userData);

/*!
 * @brief I3C slave handle structure.
 * @note The contents of this structure are private and subject to change.
 */
struct _i3c_slave_handle
{
    i3c_slave_transfer_t transfer;          /*!< I3C slave transfer copy. */
    bool isBusy;                            /*!< Whether transfer is busy. */
    bool wasTransmit;                       /*!< Whether the last transfer was a transmit. */
    uint32_t eventMask;                     /*!< Mask of enabled events. */
    uint32_t transferredCount;              /*!< Count of bytes transferred. */
    i3c_slave_transfer_callback_t callback; /*!< Callback function called at transfer event. */
    void *userData;                         /*!< Callback parameter passed to callback. */
    uint8_t *ibiData;                       /*!< IBI data buffer */
    size_t ibiDataSize;                     /*!< IBI data size */
};

/*! @} */

/*!
 * @addtogroup i3c_common_driver
 * @{
 */

/*!
 * @brief Structure with settings to initialize the I3C module, could both initialize master and slave functionality.
 *
 * This structure holds configuration settings for the I3C peripheral. To initialize this
 * structure to reasonable defaults, call the I3C_GetDefaultConfig() function and
 * pass a pointer to your configuration structure instance.
 *
 * The configuration structure can be made constant so it resides in flash.
 */
typedef struct _i3c_config
{
    i3c_master_enable_t enableMaster; /*!< Enable master mode. */
    bool disableTimeout;              /*!< Whether to disable timeout to prevent the ERRWARN. */
    i3c_master_hkeep_t hKeep;         /*!< High keeper mode setting. */
    bool enableOpenDrainStop;         /*!< Whether to emit open-drain speed STOP. */
    bool enableOpenDrainHigh;         /*!< Enable Open-Drain High to be 1 PPBAUD count for i3c messages, or 1 ODBAUD. */
    i3c_baudrate_hz_t baudRate_Hz;    /*!< Desired baud rate settings. */
    uint8_t masterDynamicAddress;     /*!< Main master dynamic address configuration. */
    uint32_t slowClock_Hz;            /*!< Slow clock frequency for time control. */
    uint32_t maxWriteLength;          /*!< Maximum write length. */
    uint32_t maxReadLength;           /*!< Maximum read length. */
    bool enableSlave;                 /*!< Whether to enable slave. */
    uint8_t staticAddr;               /*!< Static address. */
    uint16_t vendorID;                /*!< Device vendor ID(manufacture ID). */
    bool enableRandomPart;            /*!< Whether to generate random part number, if using random part number,
                                           the partNumber variable setting is meaningless. */
    uint32_t partNumber;              /*!< Device part number info */
    uint8_t dcr;                      /*!< Device characteristics register information. */
    uint8_t bcr;                      /*!< Bus characteristics register information. */
    uint8_t hdrMode;                  /*!< Support hdr mode, could be OR logic in enumeration:i3c_hdr_mode_t. */
    bool nakAllRequest;               /*!< Whether to reply NAK to all requests except broadcast CCC. */
    bool ignoreS0S1Error;             /*!< Whether to ignore S0/S1 error in SDR mode. */
    bool offline; /*!< Whether to wait 60 us of bus quiet or HDR request to ensure slave track SDR mode safely. */
    bool matchSlaveStartStop; /*!< Whether to assert start/stop status only the time slave is addressed. */
} i3c_config_t;

/*! @} */

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! Array to map I3C instance number to IRQ number. */
extern IRQn_Type const kI3cIrqs[];

/*! Pointer to master IRQ handler for each instance. */
extern i3c_master_isr_t s_i3cMasterIsr;

/*! Pointers to master handles for each instance. */
extern void *s_i3cMasterHandle[];

/*! Pointers to slave handles for each instance. */
extern i3c_slave_handle_t *s_i3cSlaveHandle[];

/*******************************************************************************
 * API
 ******************************************************************************/
#
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @addtogroup i3c_common_driver
 * @{
 */
/*!
 * @brief Get which instance current I3C is used.
 * @param base The I3C peripheral base address.
 */
uint32_t I3C_GetInstance(I3C_Type *base);
/*!
 * @brief Provides a default configuration for the I3C peripheral, the configuration covers both master
 * functionality and slave functionality.
 *
 * This function provides the following default configuration for I3C:
 * @code
 *    config->enableMaster                 = kI3C_MasterCapable;
 *    config->disableTimeout               = false;
 *    config->hKeep                        = kI3C_MasterHighKeeperNone;
 *    config->enableOpenDrainStop          = true;
 *    config->enableOpenDrainHigh          = true;
 *    config->baudRate_Hz.i2cBaud          = 400000U;
 *    config->baudRate_Hz.i3cPushPullBaud  = 12500000U;
 *    config->baudRate_Hz.i3cOpenDrainBaud = 2500000U;
 *    config->masterDynamicAddress         = 0x0AU;
 *    config->slowClock_Hz                 = 1000000U;
 *    config->enableSlave                  = true;
 *    config->vendorID                     = 0x11BU;
 *    config->enableRandomPart             = false;
 *    config->partNumber                   = 0;
 *    config->dcr                          = 0;
 *    config->bcr = 0;
 *    config->hdrMode             = (uint8_t)kI3C_HDRModeDDR;
 *    config->nakAllRequest       = false;
 *    config->ignoreS0S1Error     = false;
 *    config->offline             = false;
 *    config->matchSlaveStartStop = false;
 * @endcode
 *
 * After calling this function, you can override any settings in order to customize the configuration,
 * prior to initializing the common I3C driver with I3C_Init().
 *
 * @param[out] config User provided configuration structure for default values. Refer to #i3c_config_t.
 */
void I3C_GetDefaultConfig(i3c_config_t *config);

/*!
 * @brief Initializes the I3C peripheral.
 * This function enables the peripheral clock and initializes the I3C peripheral as described by the user
 * provided configuration. This will initialize both the master peripheral and slave peripheral so that I3C
 * module could work as pure master, pure slave or secondary master, etc.
 * A software reset is performed prior to configuration.
 *
 * @param base The I3C peripheral base address.
 * @param config User provided peripheral configuration. Use I3C_GetDefaultConfig() to get a set of
 * defaults that you can override.
 * @param sourceClock_Hz Frequency in Hertz of the I3C functional clock. Used to calculate the baud rate divisors,
 *      filter widths, and timeout periods.
 */
void I3C_Init(I3C_Type *base, const i3c_config_t *config, uint32_t sourceClock_Hz);

/*! @} */

/*!
 * @addtogroup i3c_master_driver
 * @{
 */

